app/views/posts/index.html.erb

    <div class="card-body">
      <% if post.recent_comments.size.zero? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5)  [["post_id", 1], ["post_id", 2], ["post_id", 3], ["post_id", 4], ["post_id", 5]]