app/views/posts/show.html.erb

    <% else %>
      <% @post.comments.includes(:author).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]