app/controllers/comments_controller.rb

    def create
      post = Post.find(params[:post_id])
      user = User.find(params[:user_id])
      comment = Comment.new(params.require(:user_post_comments).permit(:text))
      comment.post = post
      comment.author = current_user
      respond_to do |format|
        format.html do
          if comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "sdjflskjosdi"], ["created_at", "2022-10-04 20:20:09.088240"], ["updated_at", "2022-10-04 20:20:09.088240"], ["author_id", 1], ["post_id", 2]]